app/controllers/comments_controller.rb

  def create
@post = Post.find(params[:post_id])
@post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "111111111"], ["post_id", 7], ["created_at", "2019-03-09 01:21:29.408628"], ["updated_at", "2019-03-09 01:21:29.408628"]]